{
	"site-title": "Using mavo",
	"site-tagline": "Thoughts and tips on using Mavo.io",
	"new-post": [
		{
			"post-title": "Getting Started with Mavo",
			"post-text": "Maybe you've read a little about Mavo (if not, go to the [Mavo website](http://mavo.io) and learn more) and now you're ready to implement it. Awesome! Here's how to get started.\n\nIn the head of the page you want to use the Mavo script, add the following code:\n\n```\n<script src=\"https://get.mavo.io/mavo.js\"></script>\n<link rel=\"stylesheet\" href=\"https://get.mavo.io/mavo.css\">\n```\n\nNow that you've connected the scripts, you need to connect the elements in the code with the scripts. To do that, choose the element you want to utilize Mavo's functionality. If you're not sure what to do here, just put it on the outside wrapper of your code--I like to create a wrapper called `#app`--and set the following attribute on that element:\n\n`mv-app=\"nameofapp\"`\n\nHere's an example:\n\n`<div mv-app=\"nameofapp\"></div>`\n\n**!important**\nSomething to remember is that you should only use alphanumeric characters for your attribute values for Mavo. No hypens or underscores. Camel case is cool or all lowercase. Otherwise, it will cause issues with Mavo Expressions later on.\n\nNow you're app is connected to the script and everything inside that element is able to utilize Mavo. The next thing you need to add is a storage source. Mavo comes with a few storage options right out of the gate:\n\n- Local storage (the user's browser)\n- Github\n- Dropbox\n- Your own storage backend\n\nFor the sake of brevity and ease of use, let's just choose local storage. This means that the data will be saved only in the browser you're using. To set this storage method add the following attribute into your app container:\n\n`<div mv-app=\"nameofapp\" mv-storage=\"local\"></div>`\n\nWhen you look at your page you should now have access to the Mavo toolbar at the place on the page where your app-ified element is (the `<div>` above). \n\nNow you're all set to start adding properties to elements that you want to change. So when you click on \"Edit\" in the Mavo toolbar you will be able to edit properties that you've marked with this attribute:\n\n`property=\"propertyname\"`\n\nRemember the naming conventions. Property names are names that you choose. Sort of like class names in CSS. Let's say we want to add an editable `<h1>` element to our page. Just add the `property` attribute to a new heading element:\n\n```\n<div mv-app=\"nameofapp\" mv-storage=\"local\">\n\n  <h1 property=\"heading1\">Some Heading</h1>\n\n</div>\n```\n\nHere's some live code of the example above:\n\n<p data-height=\"300\" data-theme-id=\"26191\" data-slug-hash=\"dZVber\" data-default-tab=\"html,result\" data-user=\"brianhaferkamp\" data-embed-version=\"2\" data-pen-title=\"Getting Started with Mavo.io\" class=\"codepen\"><a href=\"https://codepen.io/brianhaferkamp/pen/dZVber/\">Getting Started with Mavo.io</a> by Brian Haferkamp (<a href=\"https://codepen.io/brianhaferkamp\">@brianhaferkamp</a>) on <a href=\"https://codepen.io\">CodePen</a>.</p>\n<script async src=\"https://production-assets.codepen.io/assets/embed/ei.js\"></script>\n\nOnce you've added at least one property attribute, you'll see the \"Edit\" button appear on the Mavo toolbar. Click \"Edit\" then hover over the `<h1>` to which you gave a property. You'll see that it's now editable. Once you're finished editing the field, click the \"Save\" button and refresh the page. You'll see that your changes have persisted! To exit the editing mode, click on \"Editing\" to toggle editing off.\n\nThe Mavo local storage option utilizes the [localStorage API](https://developer.mozilla.org/en-US/docs/Web/API/Window/localStorage) so your changes will stay in the browser's storage even if you close the tab or the browser altogether. The only way to clear that storage is to use a script or manually remove the storage in your browser.\n\nThat's the very basic gist of Mavo. There is a lot more that can be done with it that will be included in further tutorials. \n\n_If you have any questions or comments, please leave them below. See something that's not right? Login, make an edit, and click \"Save.\" It will be sent as a pull request that I'll review._\n\nwritten by [Brian Haferkamp](https://twitter.com/BrianHaferkamp)\n\n\n---\n\n### Comments\n\nQuestions or comments about Mavo? If you have a Github account, click \"Login\" and then \"Edit\" in the toolbar above and leave a question or comment above the first comment.\n\n[Who wants to be first?]"
		}
	],
	"widget-image": "http://mavo.io/favicon.ico",
	"new-widget": [
		{
			"widget-header": "About this site",
			"widget-text": "This is a space to write about using Mavo, an exciting new front end editor that bolts onto any HTML website. It gives you the ability to edit and create content without a relational database or advanced scripting.\n\n_This page is created and maintained using Mavo._"
		},
		{
			"widget-header": "Why use Mavo?",
			"widget-text": "- Author in Markdown\n- Connects to any site\n- No database necessary\n- Easy to deploy\n- Fast\n- Secure\n- Plays nice with HTML\n- Plays nice with SEO"
		}
	]
}