{
	"book-image": "https://files.tyndale.com/thpdata/images--covers/HiResJPG/978-1-62405-354-2.jpg?width=330",
	"book-title": "Kingdom Woman",
	"book-subtitle": "Embracing Your Purpose, Power, and Possibilities",
	"book-author": "Tony Evans and Chrystal Evans Hurst",
	"publish-date": "March 1, 2015",
	"trim-size": "5.5 x 8.25 in.",
	"pages": "240",
	"isbn": "978-1-62405-354-2",
	"chapter": [
		{
			"chapter-title": "Acknowledgements",
			"chapter-text": "I never imagined this life, one bursting at the seams with more goodness than any man could manage alone. Yet it has somehow been balanced with grace because of you, Lois. The greatest story in all the books of the world could never describe the affection and appreciation I have for you. Anything good I have ever accomplished has been because of you. What can I say, except thank you.\n\nChrystal, I was a twenty-two-year-old young man, steeped in inexperience, the very first time I laid eyes on you. The doctor came through the double doors into the waiting room where I’d been frantically pacing, and he told me you were here. And when I saw you, I knew I would never be the same again.\n\nI could never have imagined that forty years later, you and I would sit down together, pens in hand, to write a book that would impact women everywhere. What a gift you have been to this project. What a gift you have been to me.\n\nTyndale and Focus on the Family: Finding publishers who carefully walk the fine line of ministry and business with grace and integrity can be a challenge. I’ve found that in you. Partnering with you on this book has been a joy. I can’t wait to do it again soon.\n\nDaddy, thanks for the loving nudge in the direction of God’s call on my life. You always see more in me than I do.\n\nMommy, I have had no better example than the one you have lived before my eyes, day in and day out, through the best and worst of times. So much of what I have learned about living as a kingdom woman, I have learned from watching you.\n\nKariss and Jessica, if you hadn’t been willing to help me make dinner, clean up the kitchen, and watch your brothers, I wouldn’t have had time to write. You are not just my daughters; you are my friends.\n\nSilla, not a day goes by that I’m not grateful that you are my one and only sissy. I know I don’t always act like it, but I’m glad when you walk over to my house and come in the back door without knocking. You are wonderful with words both spoken and written. Thanks for letting me learn from you.\n\nMany thanks to Kanika, Michelle, and Wynter, who let me borrow their brains on a regular basis and granted me access to their insights and creativity. I appreciate every reply to my incessant e-mails, texts, and calls.\n\nSally Clarkson and Zan Tyler, your words of encouragement echo in my mind on a regular basis. Your words of affirmation watered dormant seeds and reminded me of who I am.\n\nAndrea, you understand my life—homeschooling, housework, and hungry boys—so your reflections have meant so much. We will eventually make more time to hang out with our crew!\n\nFocus on the Family and Tyndale House Publishers, thanks for the opportunity to work on a project with my dad.\n\nAnd last but certainly not least, to my husband, Jessie, my kingdom man—you are the reason I have the freedom to find my path and try new things. Your deep and consistent love for this crazy wife God gave you makes my heart melt—over and over."
		},
		{
			"chapter-title": "Foreword",
			"chapter-subtitle": "Lois Evans and Priscilla Hurst",
			"chapter-text": "A few women sighed in hesitation when we told them about this book. The\nthought of another manual to tell them what they aren’t doing well and to give\nthem instructions on how to change didn’t sound appealing. The mere mention\nof a kingdom woman conjured up an idealistic image, one that instantly became\na burden. Maybe, honestly, you feel the same way—a bit weary of having a\nfinger waving in your face demanding that you do better—especially when you\nare already doing your absolute best.\nWe understand. Trust us, we understand—which is why we’re glad you’ve\nopened this book.\nThis book, much like its companion Kingdom Man, will be unlike others\nyou’ve read. It won’t inform you and then leave you hanging to deal with a sense\nof condemnation and guilt. Every chapter will encourage and applaud you and\nthen show you theologically and practically how to have the kind of faith that\nwill usher in the miracle you’ve been looking for—the one you’ve been longing\nto see unfold in your family, church, or community. It will hand you a sword\nand then inspire you to draw it in the face of adversity instead of shrinking back\ninto complacency or even into despair. After you take in these pages, you will\nbe encouraged and you will also be empowered for the journey ahead.\nMerging two unique messages into a succinct and singular package requires\na pair of people who have walked through the annals of experience together.\nOur husband/father and daughter/sister are just the duo to make it happen.\nWith Chrystal’s frank, authentic, real-life perspective punctuating Tony’s biblically\ninspired teaching, you will find this read an eye-opening and enlightening\nadventure through Scripture and then into your own heart.\nChrystal’s a bit new on the publishing scene, but she shines in the women’s\nministry at our church and in our lives personally. For many years now, she has\nled the ladies of our local congregation, training them to be women of purpose\nwho are equipped to reach their full potential. In a Christian world filled with\nfolks striving for the limelight and a microphone, she has earned an esteemed\nplace within the local church. That’s something worth talking about. Her ability \nxiv FOREWORD\nto engage and inspire an audience is compelling, but her faithfulness to disciple\nwomen one-on-one is admirable and has inspired others to do the same.\nEven more impactful than that, Chrystal has managed to keep her priorities\nin place, structuring her time and efforts to focus primarily on her family.\nHonestly, we don’t know how she does it, and we stand in awe of her every day.\nAs a homeschool mother of five children, she knows the juggling act performed\nby millions of women the world over and has demonstrated what it means to\nhonor God as a wife and mother. To top it off, she makes a loaf of homemade\npumpkin bread that will make your mouth water.\nIn between washing dinner dishes, creating lesson plans, and taking the\noccasional field trip, Chrystal has managed to find time to blog her thoughts\nand life happenings in a way that has captured the attention of women. The\ntreasure you will uncover in this manuscript will come not only from Tony’s\nteaching but also from the story of Chrystal’s life. Her deep, thriving relationship\nwith Jesus is seen in every word, and her vulnerability and quick wit will\ndraw you in and then cause you to see yourself in her life. You’ll laugh at her\nstories and see the biblical truth she intended to share. Chrystal is refreshingly\nunassuming. Not perfect but purposeful. You won’t feel pressured to emulate\nher, but you will want to walk alongside her.\nTony probably doesn’t need any introduction. He has written more than\nsixty books, so the one you are holding in your hands is a continuation of a long\nline of fantastic titles. His contribution in publishing has blessed millions of\npeople the world over and made an indelible mark on the health of the global\nchurch. His desire to uncover and then relay theological truths in a practical,\nrelevant way has been the mark of his ministry—a ministry in which he has\nserved his entire adult life. He is a faithful man who has dedicated himself to\nthe Lord, his family, and the local church.\nFor more than three decades, he has pastored the same flock.\nFor more than four decades, he has loved the same wife.\nFor nearly five decades, he has taught the same unadulterated gospel of\nJesus Christ. The depth of his integrity and character match the widespread\nreach of his ministry.\nWe wish we could have pulled you around our kitchen table to experience\nthe after-dinner devotions that happened most nights in our home. Or invited \nFOREWORD x v\nyou along for our yearly month-long road trip through the States that he courageously\ntook us on each August. Or had you join us for Sunday-morning\nservice where we’ve sat under his inspired teaching for thirty-seven years. Then\nyou’d see the real man behind the larger-than-life persona—the introspective\nand loving pastor, father, and friend who has a heart that will resonate with\nyours through every portion of this book.\nSo, here’s the deal: This book is like a train track headed to a destination\nthat is worth every ounce of energy spent making the trip. And, like any track,\nthis one has two rails bound together by the rungs of wisdom and experience.\nAt different points in your journey, you’ll need to be willing to hop on each\none of these rails in order to get the most out of your reading. Each will\nallow you a different vantage point that will enhance the other. One side is\nTony’s—biblical, thought-provoking, and appropriately intense. It will require\nyou to look into your Bible and then into your own soul as you learn lessons\nfrom ancient women that you may never have gathered before. Then Chrystal\nwill beckon you over to her side of the track. You’ll grab her hand, steady yourself\non her rail, and begin a personal journey that will allow you to apply the\ntruths you’ve been reading about.\nWe’ll be honest and tell you that the ride won’t always be easy and seamless.\nThere might be some turns on a few steep spiritual cliffs that might make you\nfeel like you won’t make it to the other side intact—but you will.\nYou will.\nTony and Chrystal.\nFather and daughter.\nThe perfect combination to bring you this incredible manuscript that will\nmark you forever. You’ll emerge richer, wiser, and more motivated to become\nthe kingdom woman you were created to be.\nBe blessed as you read."
		}
	]
}