{
	"book-image": "https://files.tyndale.com/thpdata/images--covers/HiResJPG/978-1-62405-354-2.jpg?width=330",
	"book-title": "Kingdom Woman",
	"book-subtitle": "Embracing Your Purpose, Power, and Possibilities",
	"book-author": "Tony Evans and Chrystal Evans Hurst",
	"publish-date": "March 1, 2015",
	"trim-size": "5.5 x 8.25 in.",
	"pages": "240",
	"isbn": "978-1-62405-354-2",
	"chapter": [
		{
			"chapter-title": "Foreword: Lois Evans and Priscilla Shirer",
			"chapter-text": "I never imagined this life, one bursting at the seams with more goodness than\nany man could manage alone. Yet it has somehow been balanced with grace\nbecause of you, Lois. The greatest story in all the books of the world could never\ndescribe the affection and appreciation I have for you. Anything good I have\never accomplished has been because of you. What can I say, except thank you.\n\nChrystal, I was a twenty-two-year-old young man, steeped in inexperience,\nthe very first time I laid eyes on you. The doctor came through the double\ndoors into the waiting room where I’d been frantically pacing, and he told me\nyou were here. And when I saw you, I knew I would never be the same again.\n\nI could never have imagined that forty years later, you and I would sit down\ntogether, pens in hand, to write a book that would impact women everywhere.\nWhat a gift you have been to this project. What a gift you have been to me.\n\nTyndale and Focus on the Family: Finding publishers who carefully walk\nthe fine line of ministry and business with grace and integrity can be a challenge.\nI’ve found that in you. Partnering with you on this book has been a joy.\nI can’t wait to do it again soon.\n\nDaddy, thanks for the loving nudge in the direction of God’s call on my life.\nYou always see more in me than I do.\n\nMommy, I have had no better example than the one you have lived before\nmy eyes, day in and day out, through the best and worst of times. So much of\nwhat I have learned about living as a kingdom woman, I have learned from\nwatching you.\n\nKariss and Jessica, if you hadn’t been willing to help me make dinner, clean\nup the kitchen, and watch your brothers, I wouldn’t have had time to write.\nYou are not just my daughters; you are my friends.\n\nSilla, not a day goes by that I’m not grateful that you are my one and only \nsissy. I know I don’t always act like it, but I’m glad when you walk over to my\nhouse and come in the back door without knocking. You are wonderful with\nwords both spoken and written. Thanks for letting me learn from you.\n\nMany thanks to Kanika, Michelle, and Wynter, who let me borrow their\nbrains on a regular basis and granted me access to their insights and creativity.\nI appreciate every reply to my incessant e-mails, texts, and calls.\n\nSally Clarkson and Zan Tyler, your words of encouragement echo in my\nmind on a regular basis. Your words of affirmation watered dormant seeds and\nreminded me of who I am.\n\nAndrea, you understand my life—homeschooling, housework, and hungry\nboys—so your reflections have meant so much. We will eventually make more\ntime to hang out with our crew!\n\nFocus on the Family and Tyndale House Publishers, thanks for the opportunity\nto work on a project with my dad.\n\nAnd last but certainly not least, to my husband, Jessie, my kingdom man—\nyou are the reason I have the freedom to find my path and try new things.\nYour deep and consistent love for this crazy wife God gave you makes my heart\nmelt—over and over."
		}
	]
}