{
	"profile_image": "https://cdn.jsdelivr.net/gh/brianhaferkamp/mv-data@2ee3259cbaa6ef027caa2bc6988a6fb341455a94/images/ERuDpJfO_400x400.jpg",
	"profile_name": "Brian Haferkamp",
	"profile_title": "Front End Web Developer",
	"profile_text": "<p>When I was in college I became interested in the Web and its potential as a publishing platform, so I bought a copy of&nbsp;<em>HTML for Dummies</em>&nbsp;and taught myself to code in my free time. Because I didn't own a computer, I worked on the library computers using Geocities to learn how to FTP files.</p>\n<p>After a year of graduate school I moved to Chicago. I loved the vibrance of the city. It was here that I learned much of the software, hardware, and design theory that I still use today.</p>\n<p>My pursuit of Web Design as a profession was a long, curved road. After starting a family, I worked various jobs and traveled. My family and I have traveled extensively in the US, Europe and East Asia. We lived in South Korea for 4 years.</p>\n<p>In 2015, I took a full-time position as Web Developer at Tyndale House Publishers. It's been great to get back into Web Development, to have opportunities to help others and to develop new ideas that will push digital publishing forward.</p>\n<p>My interests are APIs, web apps, and digital publishing. I create tutorials on&nbsp;<a style=\"color: #333333;\" href=\"https://www.youtube.com/channel/UCiwvLFLe1xjQO9v7uPxKAnQ\" target=\"_blank\" rel=\"noopener\">my YouTube channel</a>&nbsp;and enjoy experimenting with design on&nbsp;<a style=\"color: #333333;\" href=\"https://codepen.io/brianhaferkamp\" target=\"_blank\" rel=\"noopener\">CodePen</a>&nbsp;and&nbsp;<a style=\"color: #333333;\" href=\"https://github.com/brianhaferkamp\" target=\"_blank\" rel=\"noopener\">Github</a>.</p>\n<p>Feel free to connect with me on&nbsp;<a style=\"color: #333333;\" href=\"https://twitter.com/brianhaferkamp\" target=\"_blank\" rel=\"noopener\">Twitter</a>.</p>\n<p>Welcome to my portfolio,</p>\n<p>B</p>",
	"profile_social_headline": "Connect",
	"social_item": [
		{
			"social_link": "#",
			"social_icon": "https://assets.codepen.io/495197/icons8-linkedin.svg"
		}
	]
}