{
	"site-title": "Using Mavo",
	"site-tagline": "Thoughts and tips on using Mavo.io",
	"new-post": [
		{
			"post-title": "First uBook Using Mavo",
			"post-text": "I've just completed my first uBook (Universal Book) using Mavo as the content editor. It was long but incredibly easy. No need for a database or backend. Just creating chapters and placing text content and headings right on the page. Here's the book online:\n\nhttp://highwaywebconsulting.com/demos/ubooks/pride-and-prejudice/\n\nOne of the cool parts was that when I created the chapter titles Mavo automatically placed the chapter title with an anchor link in the navigation (huge thanks to Lea Verou for helping me get that straightened out). I only had to fill in the chapter content, which saved a lot of time. Taking the text of the novel from the Project Gutenberg text file, it took about 6 hours to make the book. I'd already created the master file with UI elements to use. You can fork the master book authoring file on Codepen and try it for yourself:\n\nhttps://codepen.io/brianhaferkamp/pen/RjQKQz\n\n### Universal Books\n\nFor 6-8 months I've been researching and prototyping a new kind of book, something I'm calling a Universal Book (uBook). It's essentially a web app that's fed by JSON data. Separating out the data from markup in our electronic books is the main idea. That way we only need one file that can flow the book text into many containers. For publishers and authors this would be a huge maintenance improvement, saving time and money and making the digital publishing process simpler.\n\nMavo helps me to this end because all the data typed into Mavo is saved in a JSON file and then served back to the web page. So now the entire text of __Pride and Prejudice__ has been separated out from the markup and could be called into any app or web page through only one source file. Where I was creating the JSON files by hand before, I can now use a front-end content editor to do data input. In fact, the only thing that took this book so long is that I was pulling from a .txt file and had to go in and clean up the line breaks.\n\nThere are a lot of reasons we should be moving to uBooks over current eBooks:\n\n- Can be visually robust\n- Cheap to produce and maintain\n- Offline capable\n- No reliance on proprietary marketplaces\n- No downloads required\n- SEO-friendly\n- Responsive/Mobile-friendly\n- Small\n- Fast\n- Simple code base for developers\n- Unique UI/UX\n- Rich media is easy to implement\n- Searchable\n- Compatible with any CMS (e.g., WordPress, Drupal)\n- Can be printed\n- Capable of being divided into 1-page or multi-page formats\n- Create one UI for multiple books\n- Books can be internationalized (translated) into multiple languages with only one code base\n\nI hope to use Mavo to quickly produce multiple copyright-free books to test out a new subscription model that (hopefully) will help authors to escape the current self-publishing model that is getting progressively worse for most.\n\nA huge thanks goes out to the Mavo team for this really amazing tool. You can [learn more about Mavo](http://mavo.io) on their website."
		},
		{
			"post-title": "Mavo Speed Test",
			"post-text": "I decided that i wanted to do a speed test to see how Mavo performs on a live site. This website is the one I chose since it's online and not a part of the Codepen system (which I regularly code in).\n\nAdmittedly, I could have done a better job optimizing the site, but for the sake of speed and convenience I have just bolted a lot of stuff on. Here are the numbers (tested at http://tools.pingdom.com on a server from San Jose, CA):\n\n- Performance Grade: 84\n- Load Time: 953ms\n- Page Size: 412kB\n- Requests: 28\n\nSo the page is a little on the heavy side, but I'm pulling in jQuery, Google fonts, Google Adsense, and Mavo via CDN. jQuery and Mavo can be downloaded and put in the root directory to avoid those requests. I could also use an image on the server as the original placeholder in the HTML. Just removing the ads and using a different image placeholder would save almost 200kB plus some requests.\n\nIn the end, Mavo adds about 60kB to your page download but it's like most libraries in that the size probably won't vary much over time and you can just calculate it into development. \n\nIf I made the changes above and got the page size down to 300kB, that would be the entire site, not just a page! Plus, there are no relational database queries or maintenance, just a request to Github to pull in the updated data."
		},
		{
			"post-title": "First Impressions of Using Mavo.io",
			"post-text": "Have you ever heard of Mavo.io? It's a relatively new editing script that bolts onto your existing HTML site and gives it super functionality, including front-end editing and content creation abilities. \n\nI've tried to implement my own versions of this using some basic jQuery but Mavo takes this far beyond anything I could have done. It's actively developed at the MIT computer science lab, and is headed by researcher and speaker, Lea Verou [@leaverou](https://twitter.com/leaverou). \n\nMy first impression is that this is a powerful way to transform a humble HTML/CSS site into a small-scale CMS. To learn more about the project, head over to the [Mavo website](http://mavo.io).\n\nThis blog has been developed with Mavo. The scripts have been bolted onto the HTML structure. To see the original code, check out this codepen:\n\nhttps://codepen.io/brianhaferkamp/pen/aVwrLQ\n\nFeel free to fork the code and make it your own. You'll need to change the `mv-app` to whatever name you desire for your app and write your own Github account username in the `mv-storage` attribute in order to make changes. Otherwise, it will come to me as a pull request (which is cool in it's own right). \n\nHere's what I love about Mavo:\n\n- You can author content in Markdown (with a version called, Showdown)\n- Perform content editing in the browser\n- Easy to understand code and implementation\n- Small-scale CMS site deployment is now easy\n- No database necessary\n- All the benefits of using Github, including versioning\n\nFor a small site or on a page-by-page basis, it's awesome.\n\nWith MIT behind the project it has an opportunity to change the way that we create websites and (probably) the influence that software like WordPress has on the world. Now we have a tool for those projects that need some data storage or user input but not a full-blown CMS. That's gotta be a game changer for a good portion of the sites on the Web."
		}
	],
	"widget-image": "http://mavo.io/favicon.ico",
	"new-widget": [
		{
			"widget-header": "About this site",
			"widget-text": "This is a space to write about using Mavo, an exciting new front end editor that bolts onto any HTML website. It gives you the ability to edit and create content without a relational database or advanced scripting.\n\n_This page is created and maintained using Mavo._"
		},
		{
			"widget-header": "Why use Mavo?",
			"widget-text": "- Author in Markdown\n- Connects to any site\n- No database necessary\n- Easy to deploy\n- Fast\n- Secure\n- Plays nice with HTML\n- Plays nice with SEO"
		}
	]
}